package MemberPackage.DAO;

import java.util.HashMap;
import java.util.List;

import org.springframework.dao.DataAccessException;
import org.springframework.web.bind.annotation.RequestParam;

import vo.Criteria;
import vo.ReservationVO;
import vo.RoomVO;
import vo.SelectVO;
import vo.StoreVO;

//-----------------------------------------------------------------------------------------------------------
// public interface MemberDAO
//-----------------------------------------------------------------------------------------------------------
public interface MemberDAO {

	//-----------------------------------------------------------------------------------------------------------
	// 이용 가능한 업체 리스트 총 갯수(conunt) 구하기(totalCount) - 페이징 처리 -
	//-----------------------------------------------------------------------------------------------------------
	public int countList() throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 이용 가능한 업체 리스트 페이지
	//-----------------------------------------------------------------------------------------------------------
	public List<StoreVO> storeViewList(Criteria cri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 이용 가능한 업체 지역별 리스트 갯수(conunt) 구하기(totalCount) - 페이징 처리 -
	//-----------------------------------------------------------------------------------------------------------
	public int countList2(SelectVO selectVO) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 이용 가능한 업체 지역별 검색
	//-----------------------------------------------------------------------------------------------------------
	public List<StoreVO> findStoreList(HashMap<String, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 지역검색 이후 메뉴 및 인원으로 검색 한 업체 리스트 갯수(conunt) 구하기(totalCount) - 페이징 처리 -
	//-----------------------------------------------------------------------------------------------------------
	public int countList3(SelectVO selectVO) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 지역검색 이후 메뉴 및 인원으로 검색
	//-----------------------------------------------------------------------------------------------------------
	public List<StoreVO> findStoreList2(HashMap<String, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 선택한 업체의 예약 가능한 방 리스트 페이지
	//-----------------------------------------------------------------------------------------------------------
	public List<RoomVO> selectStoreRoomList(HashMap<Object, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 선택한 업체의 예약 완료된 방 리스트 페이지
	//-----------------------------------------------------------------------------------------------------------
	public List<RoomVO> completionRoomList(HashMap<Object, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 선택한 날짜와 업체의 예약 가능한 방 리스트 페이지
	//-----------------------------------------------------------------------------------------------------------
	public List<RoomVO> selectDateRoomList(HashMap<Object, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 선택한 날짜와 업체의 예약 완료된 방 리스트 페이지
	//-----------------------------------------------------------------------------------------------------------
	public List<RoomVO> completionDateRoomList(HashMap<Object, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 해당 업체의 휴무일 여부 판단하기.
	//-----------------------------------------------------------------------------------------------------------
	public int restCheck(HashMap<Object, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 회원 온라인 예약하기
	//-----------------------------------------------------------------------------------------------------------
	public int onlineReservation(ReservationVO reservationVO) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 회원 예약내역 확인하기 페이지
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, Object>> myReservation(HashMap<Object, Object> map) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 회원 예약 취소하기
	//-----------------------------------------------------------------------------------------------------------
	public int myReservationCancle(HashMap<String, Object> map) throws DataAccessException;
	
}// End - public interface MemberDAO
